{"Complex Sentences":"Although it was raining, we decided to go for a hike."}
{"Complex Sentences":"When the sun sets, the sky turns a beautiful shade of orange."}
{"Complex Sentences":"Because she studied hard, she passed the exam with flying colors."}
{"Complex Sentences":"If you want to succeed, you must be willing to work hard."}
{"Complex Sentences":"While the children played outside, the adults prepared dinner."}
{"Complex Sentences":"Although he was tired, he continued to work on the project."}
{"Complex Sentences":"Whenever she feels sad, she listens to her favorite music."}
{"Complex Sentences":"Because it was his birthday, he received many gifts."}
{"Complex Sentences":"If you have any questions, please let me know."}
{"Complex Sentences":"When the movie ended, we all clapped."}
{"Complex Sentences":"Although she loves chocolate, she decided to eat an apple."}
{"Complex Sentences":"Because it was cold outside, we stayed indoors."}
{"Complex Sentences":"While he was reading, his phone rang."}
{"Complex Sentences":"If you are feeling unwell, you should see a doctor."}
{"Complex Sentences":"When the phone rang, she answered it quickly."}
{"Complex Sentences":"Although it was late, we decided to go for a walk."}
{"Complex Sentences":"Because she was hungry, she made a sandwich."}
{"Complex Sentences":"If you finish your homework, you can watch TV."}
{"Complex Sentences":"When the bell rang, the students left the classroom."}
{"Complex Sentences":"Although he was nervous, he gave a great speech."}
{"Complex Sentences":"Because it was raining, we took an umbrella."}
{"Complex Sentences":"While they were talking, the baby fell asleep."}
{"Complex Sentences":"If you want to join us, please let me know."}
{"Complex Sentences":"When the sun rises, the birds start to sing."}
{"Complex Sentences":"Although she was tired, she went to the gym."}
{"Complex Sentences":"Because he was late, he missed the bus."}
{"Complex Sentences":"If you need help, don't hesitate to ask."}
{"Complex Sentences":"When the fireworks started, everyone looked up."}
{"Complex Sentences":"Although it was snowing, we went for a walk."}
{"Complex Sentences":"Because she was happy, she smiled all day."}
{"Complex Sentences":"While he was cooking, the dog barked."}
{"Complex Sentences":"If you see anything suspicious, report it immediately."}
{"Complex Sentences":"When the lights went out, we lit candles."}
{"Complex Sentences":"Although it was expensive, she bought the dress."}
{"Complex Sentences":"Because he was sleepy, he went to bed early."}
{"Complex Sentences":"If you want to learn more, visit our website."}
{"Complex Sentences":"When the storm passed, we went outside."}
{"Complex Sentences":"Although she was scared, she faced her fears."}
{"Complex Sentences":"Because it was dark, we used a flashlight."}
{"Complex Sentences":"While they were hiking, they saw a bear."}
{"Complex Sentences":"If you forget something, just call me."}
{"Complex Sentences":"When the cake was ready, we sang happy birthday."}
{"Complex Sentences":"Although it was difficult, he solved the problem."}
{"Complex Sentences":"Because she was excited, she couldn't sleep."}
{"Complex Sentences":"If you are ready, let's get started."}
{"Complex Sentences":"When the music started, everyone danced."}
{"Complex Sentences":"Although it was hot, we went to the beach."}
{"Complex Sentences":"Because he was angry, he yelled at his friend."}
{"Complex Sentences":"If you are interested, please sign up."}
{"Complex Sentences":"When the train arrived, we boarded quickly."}
{"Complex Sentences":"Although she was lonely, she stayed strong."}
{"Complex Sentences":"Because it was urgent, he called immediately."}
{"Complex Sentences":"If you feel tired, take a break."}
{"Complex Sentences":"When the guests arrived, we greeted them warmly."}
{"Complex Sentences":"Although it was boring, he paid attention."}
{"Complex Sentences":"Because she was late, she missed the meeting."}
{"Complex Sentences":"If you are lost, ask for directions."}
{"Complex Sentences":"When the car broke down, we called for help."}
{"Complex Sentences":"Although he was injured, he finished the race."}
{"Complex Sentences":"Because it was delicious, she asked for the recipe."}
{"Complex Sentences":"If you have time, please join us."}
{"Complex Sentences":"When the baby cried, the mother comforted him."}
{"Complex Sentences":"Although it was loud, she managed to focus."}
{"Complex Sentences":"Because he was curious, he asked many questions."}
{"Complex Sentences":"If you are free, let's go out."}
{"Complex Sentences":"When the movie started, everyone was silent."}
{"Complex Sentences":"Although it was challenging, he succeeded."}
{"Complex Sentences":"Because she was creative, she made beautiful art."}
{"Complex Sentences":"If you are hungry, there's food in the kitchen."}
{"Complex Sentences":"When the show ended, the audience applauded."}
{"Complex Sentences":"Although it was risky, they took the chance."}
{"Complex Sentences":"Because it was necessary, they made the change."}
{"Complex Sentences":"If you are interested, please contact us."}
{"Complex Sentences":"When the sun set, we lit a fire."}
{"Complex Sentences":"Although she was nervous, she performed well."}
{"Complex Sentences":"Because it was important, he prioritized it."}
{"Complex Sentences":"If you need anything, feel free to ask."}
{"Complex Sentences":"When the book was published, it became a bestseller."}
{"Complex Sentences":"Although it was noisy, she continued working."}
{"Complex Sentences":"Because he was talented, he got the job."}
{"Complex Sentences":"If you have a question, raise your hand."}
{"Complex Sentences":"When the storm hit, we took shelter."}
{"Complex Sentences":"Although it was far, we decided to visit."}
{"Complex Sentences":"Because she was kind, everyone liked her."}
{"Complex Sentences":"If you want to participate, let us know."}
{"Complex Sentences":"When the test was over, everyone sighed in relief."}
{"Complex Sentences":"Although it was painful, he endured it."}
{"Complex Sentences":"Because it was funny, they laughed a lot."}
{"Complex Sentences":"If you are ready, we can begin."}
{"Complex Sentences":"When the bell rang, the class ended."}
{"Complex Sentences":"Although it was dark, they found their way."}
{"Complex Sentences":"Because he was honest, they trusted him."}
{"Complex Sentences":"If you want to know more, keep reading."}
{"Complex Sentences":"When the parade started, the streets were filled with people."}
{"Complex Sentences":"Although it was late, they kept talking."}
{"Complex Sentences":"Because it was broken, they couldn't use it."}
{"Complex Sentences":"If you feel cold, wear a jacket."}
{"Complex Sentences":"When the door opened, we were surprised."}
{"Complex Sentences":"Although it was simple, it was effective."}
{"Complex Sentences":"Because he was determined, he achieved his goal."}
{"Complex Sentences":"If you are busy, I can help you."}
{"Complex Sentences":"When the party began, everyone was excited."}
{"Complex Sentences":"Although it was raining, they played outside."}
{"Complex Sentences":"Because it was cheap, they bought it."}
{"Complex Sentences":"If you are careful, you won't get hurt."}
{"Complex Sentences":"When the alarm went off, we woke up."}
{"Complex Sentences":"Although it was hard, he didn't give up."}
{"Complex Sentences":"Because she was generous, she donated money."}
{"Complex Sentences":"If you need a ride, call me."}
{"Complex Sentences":"When the news broke, everyone was shocked."}
{"Complex Sentences":"Although it was crowded, they enjoyed the concert."}
{"Complex Sentences":"Because it was new, it worked perfectly."}
{"Complex Sentences":"If you feel lost, look at the map."}
{"Complex Sentences":"When the baby smiled, everyone was happy."}
{"Complex Sentences":"Although it was tiring, they finished the project."}
{"Complex Sentences":"Because it was valuable, they kept it safe."}
{"Complex Sentences":"If you are thirsty, there's water in the fridge."}
{"Complex Sentences":"When the lights came back on, we cheered."}
{"Complex Sentences":"Although it was noisy, he slept well."}
{"Complex Sentences":"Because it was fragile, they handled it carefully."}
{"Complex Sentences":"If you are excited, let's start."}
{"Complex Sentences":"When the game ended, we celebrated."}
{"Complex Sentences":"Although it was expensive, it was worth it."}
{"Complex Sentences":"Because it was his turn, he stepped forward."}
{"Complex Sentences":"If you are ready, we can leave now."}
{"Complex Sentences":"When the sun rose, the day began."}
{"Complex Sentences":"Although it was far, they walked."}
{"Complex Sentences":"Because she was brave, she faced the danger."}
{"Complex Sentences":"If you have any issues, report them."}
{"Complex Sentences":"When the power went out, we used candles."}
{"Complex Sentences":"Although it was late, he kept working."}
{"Complex Sentences":"Because it was important, she wrote it down."}
{"Complex Sentences":"If you feel happy, share it with others."}
{"Complex Sentences":"When the cake was cut, we all got a piece."}
{"Complex Sentences":"Although it was cold, they went swimming."}
{"Complex Sentences":"Because it was urgent, she called immediately."}
{"Complex Sentences":"If you are ready, let's go."}
{"Complex Sentences":"When the song played, we danced."}
{"Complex Sentences":"Although it was broken, he fixed it."}
{"Complex Sentences":"Because it was raining, they stayed inside."}
{"Complex Sentences":"If you are tired, get some rest."}
{"Complex Sentences":"When the doorbell rang, we answered it."}
{"Complex Sentences":"Although it was hot, they enjoyed the day."}
{"Complex Sentences":"Because it was late, they left."}
{"Complex Sentences":"If you are interested, sign up here."}
{"Complex Sentences":"When the movie started, the lights dimmed."}
{"Complex Sentences":"Although it was difficult, they succeeded."}
{"Complex Sentences":"Because it was new, everyone wanted one."}
{"Complex Sentences":"If you need help, don't hesitate to ask."}
{"Complex Sentences":"When the fireworks began, the sky lit up."}
{"Complex Sentences":"Although it was dangerous, they continued."}
{"Complex Sentences":"Because it was his dream, he pursued it."}
{"Complex Sentences":"If you are free, let's meet."}
{"Complex Sentences":"When the rain stopped, we went outside."}
{"Complex Sentences":"Although it was complicated, she understood."}
{"Complex Sentences":"Because it was necessary, they did it."}
{"Complex Sentences":"If you have questions, please ask."}
{"Complex Sentences":"When the lights went out, we found candles."}
{"Complex Sentences":"Although it was noisy, he concentrated."}
{"Complex Sentences":"Because it was delicious, they ate it all."}
{"Complex Sentences":"If you are hungry, there's food in the fridge."}
{"Complex Sentences":"When the show began, everyone was silent."}
{"Complex Sentences":"Although it was simple, it was beautiful."}
{"Complex Sentences":"Because it was dark, we used flashlights."}
{"Complex Sentences":"If you are curious, find out more."}
{"Complex Sentences":"When the guests arrived, we greeted them."}
{"Complex Sentences":"Although it was challenging, they did it."}
{"Complex Sentences":"Because it was important, they focused on it."}
{"Complex Sentences":"If you need anything, let me know."}
{"Complex Sentences":"When the train arrived, we got on board."}
{"Complex Sentences":"We went for a hike although it was raining."}
{"Complex Sentences":"The sky turns a beautiful shade of orange when the sun sets."}
{"Complex Sentences":"She passed the exam with flying colors because she studied hard."}
{"Complex Sentences":"You must be willing to work hard if you want to succeed."}
{"Complex Sentences":"The adults prepared dinner while the children played outside."}
{"Complex Sentences":"He continued to work on the project although he was tired."}
{"Complex Sentences":"She listens to her favorite music whenever she feels sad."}
{"Complex Sentences":"He received many gifts because it was his birthday."}
{"Complex Sentences":"Please let me know if you have any questions."}
{"Complex Sentences":"We all clapped when the movie ended."}
{"Complex Sentences":"She decided to eat an apple although she loves chocolate."}
{"Complex Sentences":"We stayed indoors because it was cold outside."}
{"Complex Sentences":"His phone rang while he was reading."}
{"Complex Sentences":"You should see a doctor if you are feeling unwell."}
{"Complex Sentences":"She answered it quickly when the phone rang."}
{"Complex Sentences":"We decided to go for a walk although it was late."}
{"Complex Sentences":"She made a sandwich because she was hungry."}
{"Complex Sentences":"You can watch TV if you finish your homework."}
{"Complex Sentences":"The students left the classroom when the bell rang."}
{"Complex Sentences":"He gave a great speech although he was nervous."}
{"Complex Sentences":"We took an umbrella because it was raining."}
{"Complex Sentences":"The baby fell asleep while they were talking."}
{"Complex Sentences":"Please let me know if you want to join us."}
{"Complex Sentences":"The birds start to sing when the sun rises."}
{"Complex Sentences":"She went to the gym although she was tired."}
{"Complex Sentences":"He missed the bus because he was late."}
{"Complex Sentences":"Don't hesitate to ask if you need help."}
{"Complex Sentences":"Everyone looked up when the fireworks started."}
{"Complex Sentences":"We went for a walk although it was snowing."}
{"Complex Sentences":"She smiled all day because she was happy."}
{"Complex Sentences":"The dog barked while he was cooking."}
{"Complex Sentences":"Report it immediately if you see anything suspicious."}
{"Complex Sentences":"We lit candles when the lights went out."}
{"Complex Sentences":"She bought the dress although it was expensive."}
{"Complex Sentences":"He went to bed early because he was sleepy."}
{"Complex Sentences":"Visit our website if you want to learn more."}
{"Complex Sentences":"We went outside when the storm passed."}
{"Complex Sentences":"She faced her fears although she was scared."}
{"Complex Sentences":"We used a flashlight because it was dark."}
{"Complex Sentences":"They saw a bear while they were hiking."}
{"Complex Sentences":"Just call me if you forget something."}
{"Complex Sentences":"We sang happy birthday when the cake was ready."}
{"Complex Sentences":"He solved the problem although it was difficult."}
{"Complex Sentences":"She couldn't sleep because she was excited."}
{"Complex Sentences":"Let's get started if you are ready."}
{"Complex Sentences":"Everyone danced when the music started."}
{"Complex Sentences":"We went to the beach although it was hot."}
{"Complex Sentences":"He yelled at his friend because he was angry."}
{"Complex Sentences":"Please sign up if you are interested."}
{"Complex Sentences":"We boarded quickly when the train arrived."}
{"Complex Sentences":"She stayed strong although she was lonely."}
{"Complex Sentences":"He called immediately because it was urgent."}
{"Complex Sentences":"Take a break if you feel tired."}
{"Complex Sentences":"We greeted them warmly when the guests arrived."}
{"Complex Sentences":"He paid attention although it was boring."}
{"Complex Sentences":"She missed the meeting because she was late."}
{"Complex Sentences":"Ask for directions if you are lost."}
{"Complex Sentences":"We called for help when the car broke down."}
{"Complex Sentences":"He finished the race although he was injured."}
{"Complex Sentences":"She asked for the recipe because it was delicious."}
{"Complex Sentences":"Please join us if you have time."}
{"Complex Sentences":"The mother comforted him when the baby cried."}
{"Complex Sentences":"She managed to focus although it was loud."}
{"Complex Sentences":"He asked many questions because he was curious."}
{"Complex Sentences":"Let's go out if you are free."}
{"Complex Sentences":"Everyone was silent when the movie started."}
{"Complex Sentences":"He succeeded although it was challenging."}
{"Complex Sentences":"She made beautiful art because she was creative."}
{"Complex Sentences":"There's food in the kitchen if you are hungry."}
{"Complex Sentences":"The audience applauded when the show ended."}
{"Complex Sentences":"They took the chance although it was risky."}
{"Complex Sentences":"They made the change because it was necessary."}
{"Complex Sentences":"Please contact us if you are interested."}
{"Complex Sentences":"We lit a fire when the sun set."}
{"Complex Sentences":"She performed well although she was nervous."}
{"Complex Sentences":"He prioritized it because it was important."}
{"Complex Sentences":"Feel free to ask if you need anything."}
{"Complex Sentences":"It became a bestseller when the book was published."}
{"Complex Sentences":"She continued working although it was noisy."}
{"Complex Sentences":"He got the job because he was talented."}
{"Complex Sentences":"Raise your hand if you have a question."}
{"Complex Sentences":"We took shelter when the storm hit."}
{"Complex Sentences":"We decided to visit although it was far."}
{"Complex Sentences":"Everyone liked her because she was kind."}
{"Complex Sentences":"Let us know if you want to participate."}
{"Complex Sentences":"Everyone sighed in relief when the test was over."}
{"Complex Sentences":"He endured it although it was painful."}
{"Complex Sentences":"They laughed a lot because it was funny."}
{"Complex Sentences":"We can begin if you are ready."}
{"Complex Sentences":"The class ended when the bell rang."}
{"Complex Sentences":"They found their way although it was dark."}
{"Complex Sentences":"They trusted him because he was honest."}
{"Complex Sentences":"Keep reading if you want to know more."}
{"Complex Sentences":"The streets were filled with people when the parade started."}
{"Complex Sentences":"They kept talking although it was late."}
{"Complex Sentences":"They couldn't use it because it was broken."}
{"Complex Sentences":"Wear a jacket if you feel cold."}
{"Complex Sentences":"We were surprised when the door opened."}
{"Complex Sentences":"It was effective although it was simple."}
{"Complex Sentences":"He achieved his goal because he was determined."}
{"Complex Sentences":"I can help you if you are busy."}
{"Complex Sentences":"Everyone was excited when the party began."}
{"Complex Sentences":"They played outside although it was raining."}
{"Complex Sentences":"They bought it because it was cheap."}
{"Complex Sentences":"You won't get hurt if you are careful."}
{"Complex Sentences":"We woke up when the alarm went off."}
{"Complex Sentences":"He didn't give up although it was hard."}
{"Complex Sentences":"She donated money because she was generous."}
{"Complex Sentences":"Call me if you need a ride."}
{"Complex Sentences":"Everyone was shocked when the news broke."}
{"Complex Sentences":"They enjoyed the concert although it was crowded."}
{"Complex Sentences":"It worked perfectly because it was new."}
{"Complex Sentences":"Look at the map if you feel lost."}
{"Complex Sentences":"Everyone was happy when the baby smiled."}
{"Complex Sentences":"They finished the project although it was tiring."}
{"Complex Sentences":"They kept it safe because it was valuable."}
{"Complex Sentences":"There's water in the fridge if you are thirsty."}
{"Complex Sentences":"We cheered when the lights came back on."}
{"Complex Sentences":"He slept well although it was noisy."}
{"Complex Sentences":"They handled it carefully because it was fragile."}
{"Complex Sentences":"Let's start if you are excited."}
{"Complex Sentences":"We celebrated when the game ended."}
{"Complex Sentences":"It was worth it although it was expensive."}
{"Complex Sentences":"He stepped forward because it was his turn."}
{"Complex Sentences":"We can leave now if you are ready."}
{"Complex Sentences":"The day began when the sun rose."}
{"Complex Sentences":"They walked although it was far."}
{"Complex Sentences":"She faced the danger because she was brave."}
{"Complex Sentences":"Report them if you have any issues."}
{"Complex Sentences":"We used candles when the power went out."}
{"Complex Sentences":"He kept working although it was late."}
{"Complex Sentences":"She wrote it down because it was important."}
{"Complex Sentences":"Share it with others if you feel happy."}
{"Complex Sentences":"We all got a piece when the cake was cut."}
{"Complex Sentences":"They went swimming although it was cold."}
{"Complex Sentences":"She called immediately because it was urgent."}
{"Complex Sentences":"Let's go if you are ready."}
{"Complex Sentences":"We danced when the song played."}
{"Complex Sentences":"He fixed it although it was broken."}
{"Complex Sentences":"They stayed inside because it was raining."}
{"Complex Sentences":"Get some rest if you are tired."}
{"Complex Sentences":"We answered it when the doorbell rang."}
{"Complex Sentences":"They enjoyed the day although it was hot."}
{"Complex Sentences":"They left because it was late."}
{"Complex Sentences":"Sign up here if you are interested."}
{"Complex Sentences":"The lights dimmed when the movie started."}
{"Complex Sentences":"They succeeded although it was difficult."}
{"Complex Sentences":"Everyone wanted one because it was new."}
{"Complex Sentences":"Don't hesitate to ask if you need help."}
{"Complex Sentences":"The sky lit up when the fireworks began."}
{"Complex Sentences":"They continued although it was dangerous."}
{"Complex Sentences":"He pursued it because it was his dream."}
{"Complex Sentences":"Let's meet if you are free."}
{"Complex Sentences":"We went outside when the rain stopped."}
{"Complex Sentences":"She understood although it was complicated."}
{"Complex Sentences":"They did it because it was necessary."}
{"Complex Sentences":"Please ask if you have questions."}
{"Complex Sentences":"We found candles when the lights went out."}
{"Complex Sentences":"He concentrated although it was noisy."}
{"Complex Sentences":"They ate it all because it was delicious."}
{"Complex Sentences":"There's food in the fridge if you are hungry."}
{"Complex Sentences":"Everyone was silent when the show began."}
{"Complex Sentences":"It was beautiful although it was simple."}
{"Complex Sentences":"We used flashlights because it was dark."}
{"Complex Sentences":"Find out more if you are curious."}
{"Complex Sentences":"We greeted them when the guests arrived."}
{"Complex Sentences":"They did it although it was challenging."}
{"Complex Sentences":"They focused on it because it was important."}
{"Complex Sentences":"Let me know if you need anything."}
{"Complex Sentences":"We got on board when the train arrived."}
{"Complex Sentences":"They traveled far although it was late."}
{"Complex Sentences":"Although it was raining, we went for a hike."}
{"Complex Sentences":"When the sun sets, the sky turns a beautiful shade of orange."}
{"Complex Sentences":"Because she studied hard, she passed the exam with flying colors."}
{"Complex Sentences":"If you want to succeed, you must be willing to work hard."}
{"Complex Sentences":"While the children played outside, the adults prepared dinner."}
{"Complex Sentences":"Although he was tired, he continued to work on the project."}
{"Complex Sentences":"Whenever she feels sad, she listens to her favorite music."}
{"Complex Sentences":"Because it was his birthday, he received many gifts."}
{"Complex Sentences":"If you have any questions, please let me know."}
{"Complex Sentences":"When the movie ended, we all clapped."}
{"Complex Sentences":"Although she loves chocolate, she decided to eat an apple."}
{"Complex Sentences":"Because it was cold outside, we stayed indoors."}
{"Complex Sentences":"While he was reading, his phone rang."}
{"Complex Sentences":"If you are feeling unwell, you should see a doctor."}
{"Complex Sentences":"When the phone rang, she answered it quickly."}
{"Complex Sentences":"Although it was late, we decided to go for a walk."}
{"Complex Sentences":"Because she was hungry, she made a sandwich."}
{"Complex Sentences":"If you finish your homework, you can watch TV."}
{"Complex Sentences":"When the bell rang, the students left the classroom."}
{"Complex Sentences":"Although he was nervous, he gave a great speech."}
{"Complex Sentences":"Because it was raining, we took an umbrella."}
{"Complex Sentences":"While they were talking, the baby fell asleep."}
{"Complex Sentences":"If you want to join us, please let me know."}
{"Complex Sentences":"When the sun rises, the birds start to sing."}
{"Complex Sentences":"Although she was tired, she went to the gym."}
{"Complex Sentences":"Because he was late, he missed the bus."}
{"Complex Sentences":"If you need help, don't hesitate to ask."}
{"Complex Sentences":"When the fireworks started, everyone looked up."}
{"Complex Sentences":"Although it was snowing, we went for a walk."}
{"Complex Sentences":"Because she was happy, she smiled all day."}
{"Complex Sentences":"While he was cooking, the dog barked."}
{"Complex Sentences":"If you see anything suspicious, report it immediately."}
{"Complex Sentences":"When the lights went out, we lit candles."}
{"Complex Sentences":"Although it was expensive, she bought the dress."}
{"Complex Sentences":"Because he was sleepy, he went to bed early."}
{"Complex Sentences":"If you want to learn more, visit our website."}
{"Complex Sentences":"When the storm passed, we went outside."}
{"Complex Sentences":"Although she was scared, she faced her fears."}
{"Complex Sentences":"Because it was dark, we used a flashlight."}
{"Complex Sentences":"While they were hiking, they saw a bear."}
{"Complex Sentences":"If you forget something, just call me."}
{"Complex Sentences":"When the cake was ready, we sang happy birthday."}
{"Complex Sentences":"Although it was difficult, he solved the problem."}
{"Complex Sentences":"Because she was excited, she couldn't sleep."}
{"Complex Sentences":"If you are ready, let's get started."}
{"Complex Sentences":"When the music started, everyone danced."}
{"Complex Sentences":"Although it was hot, we went to the beach."}
{"Complex Sentences":"Because he was angry, he yelled at his friend."}
{"Complex Sentences":"If you are interested, please sign up."}
{"Complex Sentences":"When the train arrived, we boarded quickly."}
{"Complex Sentences":"Although she was lonely, she stayed strong."}
{"Complex Sentences":"Because it was urgent, he called immediately."}
{"Complex Sentences":"If you feel tired, take a break."}
{"Complex Sentences":"When the guests arrived, we greeted them warmly."}
{"Complex Sentences":"Although it was boring, he paid attention."}
{"Complex Sentences":"Because she was late, she missed the meeting."}
{"Complex Sentences":"If you are lost, ask for directions."}
{"Complex Sentences":"When the car broke down, we called for help."}
{"Complex Sentences":"Although he was injured, he finished the race."}
{"Complex Sentences":"Because it was delicious, she asked for the recipe."}
{"Complex Sentences":"If you have time, please join us."}
{"Complex Sentences":"When the baby cried, the mother comforted him."}
{"Complex Sentences":"Although it was loud, she managed to focus."}
{"Complex Sentences":"Because he was curious, he asked many questions."}
{"Complex Sentences":"If you are free, let's go out."}
{"Complex Sentences":"When the movie started, everyone was silent."}
{"Complex Sentences":"Although it was challenging, he succeeded."}
{"Complex Sentences":"Because she was creative, she made beautiful art."}
{"Complex Sentences":"If you are hungry, there's food in the kitchen."}
{"Complex Sentences":"When the show ended, the audience applauded."}
{"Complex Sentences":"Although it was risky, they took the chance."}
{"Complex Sentences":"Because it was necessary, they made the change."}
{"Complex Sentences":"If you are interested, please contact us."}
{"Complex Sentences":"When the sun set, we lit a fire."}
{"Complex Sentences":"Although she was nervous, she performed well."}
{"Complex Sentences":"Because it was important, he prioritized it."}
{"Complex Sentences":"If you need anything, feel free to ask."}
{"Complex Sentences":"When the book was published, it became a bestseller."}
{"Complex Sentences":"Although it was noisy, she continued working."}
{"Complex Sentences":"Because he was talented, he got the job."}
{"Complex Sentences":"Although it was raining, Alice went for a hike."}
{"Complex Sentences":"When the sun sets, the Eiffel Tower looks magnificent."}
{"Complex Sentences":"Because James studied hard, he passed the exam with flying colors."}
{"Complex Sentences":"If you want to succeed, you must be willing to work hard like Elon Musk."}
{"Complex Sentences":"While the children played outside, Mrs. Smith prepared dinner."}
{"Complex Sentences":"Although he was tired, John continued to work on the project."}
{"Complex Sentences":"Whenever she feels sad, Maria listens to her favorite music."}
{"Complex Sentences":"Because it was his birthday, Michael received many gifts."}
{"Complex Sentences":"If you have any questions, please ask Dr. Brown."}
{"Complex Sentences":"When the movie ended, the audience at AMC Theater clapped."}
{"Complex Sentences":"Although she loves chocolate, Emily decided to eat an apple."}
{"Complex Sentences":"Because it was cold outside, we stayed indoors at the Hilton Hotel."}
{"Complex Sentences":"While he was reading, David's phone rang."}
{"Complex Sentences":"If you are feeling unwell, you should see Dr. Williams."}
{"Complex Sentences":"When the phone rang, Jessica answered it quickly."}
{"Complex Sentences":"Although it was late, Sarah decided to go for a walk."}
{"Complex Sentences":"Because she was hungry, Lucy made a sandwich."}
{"Complex Sentences":"If you finish your homework, you can watch TV on Netflix."}
{"Complex Sentences":"When the bell rang, the students at Lincoln High School left the classroom."}
{"Complex Sentences":"Although he was nervous, Alex gave a great speech at the conference."}
{"Complex Sentences":"Because it was raining, we took an umbrella from Walmart."}
{"Complex Sentences":"While they were talking, the baby fell asleep in Mary's arms."}
{"Complex Sentences":"If you want to join us, please let Mr. Thompson know."}
{"Complex Sentences":"When the sun rises, the birds at Central Park start to sing."}
{"Complex Sentences":"Although she was tired, Hannah went to the gym."}
{"Complex Sentences":"Because he was late, Tom missed the bus."}
{"Complex Sentences":"If you need help, don't hesitate to ask Mr. Johnson."}
{"Complex Sentences":"When the fireworks started, everyone at Disneyland looked up."}
{"Complex Sentences":"Although it was snowing, we went for a walk in Times Square."}
{"Complex Sentences":"Because she was happy, Emma smiled all day."}
{"Complex Sentences":"While he was cooking, Max's dog barked."}
{"Complex Sentences":"If you see anything suspicious, report it to Officer Martinez immediately."}
{"Complex Sentences":"When the lights went out, we lit candles from Yankee Candle."}
{"Complex Sentences":"Although it was expensive, Olivia bought the dress from Macy's."}
{"Complex Sentences":"Because he was sleepy, Daniel went to bed early."}
{"Complex Sentences":"If you want to learn more, visit the Smithsonian website."}
{"Complex Sentences":"When the storm passed, we went outside in San Francisco."}
{"Complex Sentences":"Although she was scared, Sophia faced her fears."}
{"Complex Sentences":"Because it was dark, we used a flashlight from Home Depot."}
{"Complex Sentences":"While they were hiking, they saw a bear in Yellowstone National Park."}
{"Complex Sentences":"If you forget something, just call Amanda."}
{"Complex Sentences":"When the cake was ready, we sang happy birthday to Jake."}
{"Complex Sentences":"Although it was difficult, he solved the problem with the help of Mr. Lee."}
{"Complex Sentences":"Because she was excited, Chloe couldn't sleep."}
{"Complex Sentences":"If you are ready, let's get started on the project for Google."}
{"Complex Sentences":"When the music started, everyone at the wedding danced."}
{"Complex Sentences":"Although it was hot, we went to the beach in Miami."}
{"Complex Sentences":"Because he was angry, Ryan yelled at his friend."}
{"Complex Sentences":"If you are interested, please sign up at the front desk."}
{"Complex Sentences":"When the train arrived, we boarded quickly at Grand Central Station."}
{"Complex Sentences":"Although she was lonely, Megan stayed strong."}
{"Complex Sentences":"Because it was urgent, he called immediately from his iPhone."}
{"Complex Sentences":"If you feel tired, take a break in the lounge."}
{"Complex Sentences":"When the guests arrived, we greeted them warmly at the Marriott."}
{"Complex Sentences":"Although it was boring, he paid attention during the lecture by Professor Clark."}
{"Complex Sentences":"Because she was late, Zoe missed the meeting at the office."}
{"Complex Sentences":"If you are lost, ask for directions at the information desk."}
{"Complex Sentences":"When the car broke down, we called for help from AAA."}
{"Complex Sentences":"Although he was injured, he finished the race at the New York Marathon."}
{"Complex Sentences":"Because it was delicious, she asked for the recipe from Chef Gordon Ramsay."}
{"Complex Sentences":"If you have time, please join us at the Rotary Club meeting."}
{"Complex Sentences":"When the baby cried, the mother comforted him at the pediatrician's office."}
{"Complex Sentences":"Although it was loud, she managed to focus at the Starbucks cafe."}
{"Complex Sentences":"Because he was curious, he asked many questions at the science fair."}
{"Complex Sentences":"If you are free, let's go out for dinner at Olive Garden."}
{"Complex Sentences":"When the movie started, everyone was silent at the Regal Cinemas."}
{"Complex Sentences":"Although it was challenging, he succeeded in completing the project for Microsoft."}
{"Complex Sentences":"Because she was creative, she made beautiful art at the New York Art Academy."}
{"Complex Sentences":"If you are hungry, there's food in the kitchen at Grandma's house."}
{"Complex Sentences":"When the show ended, the audience applauded at the Broadway theater."}
{"Complex Sentences":"Although it was risky, they took the chance in the stock market."}
{"Complex Sentences":"Because it was necessary, they made the change in the company's policy."}
{"Complex Sentences":"If you are interested, please contact the admissions office at Harvard."}
{"Complex Sentences":"When the sun set, we lit a fire at the beach in Malibu."}
{"Complex Sentences":"Although she was nervous, she performed well at the recital."}
{"Complex Sentences":"Because it was important, he prioritized it at work."}
{"Complex Sentences":"If you need anything, feel free to ask the concierge at the Ritz-Carlton."}
{"Complex Sentences":"When the book was published, it became a bestseller on Amazon."}
{"Complex Sentences":"Although it was noisy, she continued working in her studio."}
{"Complex Sentences":"Because he was talented, he got the job at Tesla."}
{"Complex Sentences":"If you have a question, raise your hand at the seminar."}
{"Complex Sentences":"When the storm hit, we took shelter in the basement."}
{"Complex Sentences":"Although it was far, we decided to visit the Grand Canyon."}
{"Complex Sentences":"Because she was kind, everyone at the community center liked her."}
{"Complex Sentences":"If you want to participate, let us know at the front desk."}
{"Complex Sentences":"When the test was over, everyone at the university sighed in relief."}
{"Complex Sentences":"Although it was painful, he endured it during the physical therapy session."}
{"Complex Sentences":"Because it was funny, they laughed a lot at the comedy club."}
{"Complex Sentences":"If you are ready, we can begin the presentation at the conference."}
{"Complex Sentences":"When the bell rang, the class at Springfield Elementary ended."}
{"Complex Sentences":"Although it was dark, they found their way in the forest."}
{"Complex Sentences":"Because he was honest, they trusted him with the finances at the firm."}
{"Complex Sentences":"If you want to know more, keep reading the article in the New York Times."}
{"Complex Sentences":"When the parade started, the streets of New Orleans were filled with people."}
{"Complex Sentences":"Although it was late, they kept talking at the after-party."}
{"Complex Sentences":"Because it was broken, they couldn't use the equipment at the gym."}
{"Complex Sentences":"If you feel cold, wear a jacket from North Face."}
{"Complex Sentences":"When the door opened, we were surprised by the new arrivals."}
{"Complex Sentences":"Although it was simple, it was effective in solving the issue."}
{"Complex Sentences":"Because he was determined, he achieved his goal at the tournament."}
{"Complex Sentences":"If you are busy, I can help you with the project."}
{"Complex Sentences":"When the party began, everyone at the clubhouse was excited."}
{"Complex Sentences":"Although it was raining, they played outside at the park."}
{"Complex Sentences":"Because it was cheap, they bought the tickets for the concert."}
{"Complex Sentences":"If you are careful, you won't get hurt during the activity."}
{"Complex Sentences":"When the alarm went off, we woke up in the hotel room."}
{"Complex Sentences":"Although it was hard, he didn't give up on his dream."}
{"Complex Sentences":"Because she was generous, she donated money to the Red Cross."}
{"Complex Sentences":"If you need a ride, call an Uber."}
{"Complex Sentences":"When the news broke, everyone at the office was shocked."}
{"Complex Sentences":"Although it was crowded, they enjoyed the concert at Madison Square Garden."}
{"Complex Sentences":"Because it was new, it worked perfectly in the lab."}
{"Complex Sentences":"If you feel lost, look at the map in the museum."}
{"Complex Sentences":"When the baby smiled, everyone at the daycare was happy."}
{"Complex Sentences":"Although it was tiring, they finished the project at the construction site."}
{"Complex Sentences":"Because it was valuable, they kept it safe in the vault."}
{"Complex Sentences":"If you are thirsty, there's water in the fridge at the break room."}
{"Complex Sentences":"When the lights came back on, we cheered at the stadium."}
{"Complex Sentences":"Although it was noisy, he slept well in the dormitory."}
{"Complex Sentences":"Because it was fragile, they handled it carefully in the store."}
{"Complex Sentences":"If you are excited, let's start the event at the convention center."}
{"Complex Sentences":"When the game ended, we celebrated in the locker room."}
{"Complex Sentences":"Although it was expensive, it was worth it to stay at the luxury resort."}
{"Complex Sentences":"Because it was his turn, he stepped forward at the chess match."}
{"Complex Sentences":"If you are ready, we can leave now for the airport."}
{"Complex Sentences":"When the sun rose, the day began in the city."}
{"Complex Sentences":"Although it was far, they walked to the village."}
{"Complex Sentences":"Because she was brave, she faced the danger in the haunted house."}
{"Complex Sentences":"If you have any issues, report them to the IT department."}
{"Complex Sentences":"When the power went out, we used candles in the cabin."}
{"Complex Sentences":"Although it was late, he kept working in his office."}
{"Complex Sentences":"Because it was important, she wrote it down in her journal."}
{"Complex Sentences":"If you feel happy, share it with others on social media."}
{"Complex Sentences":"When the cake was cut, we all got a piece at the birthday party."}
{"Complex Sentences":"Although it was cold, they went swimming in the lake."}
{"Complex Sentences":"Because it was urgent, she called immediately from her office phone."}
{"Complex Sentences":"If you are ready, let's go to the conference room."}
{"Complex Sentences":"When the song played, we danced at the wedding reception."}
{"Complex Sentences":"Although it was broken, he fixed it in his garage."}
{"Complex Sentences":"Because it was raining, they stayed inside at the cabin."}
{"Complex Sentences":"If you are tired, get some rest in the guest room."}
{"Complex Sentences":"When the doorbell rang, we answered it at the front door."}
{"Complex Sentences":"Although it was hot, they enjoyed the day at the amusement park."}
{"Complex Sentences":"Because it was late, they left the restaurant."}
{"Complex Sentences":"If you are interested, sign up here for the workshop."}
{"Complex Sentences":"When the movie started, the lights dimmed in the theater."}
{"Complex Sentences":"Although it was difficult, they succeeded in the competition."}
{"Complex Sentences":"Because it was new, everyone wanted one in the office."}
{"Complex Sentences":"If you need help, don't hesitate to ask the librarian."}
{"Complex Sentences":"When the fireworks began, the sky lit up over the river."}
{"Complex Sentences":"Although it was dangerous, they continued the expedition."}
{"Complex Sentences":"Because it was his dream, he pursued it at the university."}
{"Complex Sentences":"If you are free, let's meet at the cafe."}
{"Complex Sentences":"When the rain stopped, we went outside in the backyard."}
{"Complex Sentences":"Although it was complicated, she understood the instructions."}
{"Complex Sentences":"Because it was necessary, they did it for the team."}
{"Complex Sentences":"If you have questions, please ask the instructor."}
{"Complex Sentences":"When the lights went out, we found candles in the cupboard."}
{"Complex Sentences":"Although it was noisy, he concentrated in the library."}
{"Complex Sentences":"Because it was delicious, they ate it all at the picnic."}
{"Complex Sentences":"If you are hungry, there's food in the fridge at Aunt Mary's house."}
{"Complex Sentences":"When the show began, everyone was silent in the auditorium."}
{"Complex Sentences":"Although it was simple, it was beautiful in design."}
{"Complex Sentences":"Because it was dark, we used flashlights during the hike."}
{"Complex Sentences":"If you are curious, find out more at the information booth."}
{"Complex Sentences":"When the guests arrived, we greeted them at the reception."}
{"Complex Sentences":"Although it was challenging, they did it for the team."}
{"Complex Sentences":"Because it was important, they focused on it during the meeting."}
{"Complex Sentences":"If you need anything, let the concierge know at the front desk."}
{"Complex Sentences":"When the train arrived, we got on board at the station."}
{"Complex Sentences":"Although it was far, they traveled to visit the museum."}
{"Complex Sentences":"Because it was valuable, they saved it in the family safe."}
{"Complex Sentences":"If you are ready, we can start the presentation."}
{"Complex Sentences":"Alice went for a hike although it was raining."}
{"Complex Sentences":"The Eiffel Tower looks magnificent when the sun sets."}
{"Complex Sentences":"James passed the exam with flying colors because he studied hard."}
{"Complex Sentences":"You must be willing to work hard like Elon Musk if you want to succeed."}
{"Complex Sentences":"Mrs. Smith prepared dinner while the children played outside."}
{"Complex Sentences":"John continued to work on the project although he was tired."}
{"Complex Sentences":"Maria listens to her favorite music whenever she feels sad."}
{"Complex Sentences":"Michael received many gifts because it was his birthday."}
{"Complex Sentences":"Please ask Dr. Brown if you have any questions."}
{"Complex Sentences":"The audience at AMC Theater clapped when the movie ended."}
{"Complex Sentences":"Emily decided to eat an apple although she loves chocolate."}
{"Complex Sentences":"We stayed indoors at the Hilton Hotel because it was cold outside."}
{"Complex Sentences":"David's phone rang while he was reading."}
{"Complex Sentences":"You should see Dr. Williams if you are feeling unwell."}
{"Complex Sentences":"Jessica answered it quickly when the phone rang."}
{"Complex Sentences":"Sarah decided to go for a walk although it was late."}
{"Complex Sentences":"Lucy made a sandwich because she was hungry."}
{"Complex Sentences":"You can watch TV on Netflix if you finish your homework."}
{"Complex Sentences":"The students at Lincoln High School left the classroom when the bell rang."}
{"Complex Sentences":"Alex gave a great speech at the conference although he was nervous."}
{"Complex Sentences":"We took an umbrella from Walmart because it was raining."}
{"Complex Sentences":"The baby fell asleep in Mary's arms while they were talking."}
{"Complex Sentences":"Please let Mr. Thompson know if you want to join us."}
{"Complex Sentences":"The birds at Central Park start to sing when the sun rises."}
{"Complex Sentences":"Hannah went to the gym although she was tired."}
{"Complex Sentences":"Tom missed the bus because he was late."}
{"Complex Sentences":"Don't hesitate to ask Mr. Johnson if you need help."}
{"Complex Sentences":"Everyone at Disneyland looked up when the fireworks started."}
{"Complex Sentences":"We went for a walk in Times Square although it was snowing."}
{"Complex Sentences":"Emma smiled all day because she was happy."}
{"Complex Sentences":"Max's dog barked while he was cooking."}
{"Complex Sentences":"Report it to Officer Martinez immediately if you see anything suspicious."}
{"Complex Sentences":"We lit candles from Yankee Candle when the lights went out."}
{"Complex Sentences":"Olivia bought the dress from Macy's although it was expensive."}
{"Complex Sentences":"Daniel went to bed early because he was sleepy."}
{"Complex Sentences":"Visit the Smithsonian website if you want to learn more."}
{"Complex Sentences":"We went outside in San Francisco when the storm passed."}
{"Complex Sentences":"Sophia faced her fears although she was scared."}
{"Complex Sentences":"We used a flashlight from Home Depot because it was dark."}
{"Complex Sentences":"They saw a bear in Yellowstone National Park while they were hiking."}
{"Complex Sentences":"Just call Amanda if you forget something."}
{"Complex Sentences":"We sang happy birthday to Jake when the cake was ready."}
{"Complex Sentences":"He solved the problem with the help of Mr. Lee although it was difficult."}
{"Complex Sentences":"Chloe couldn't sleep because she was excited."}
{"Complex Sentences":"Let's get started on the project for Google if you are ready."}
{"Complex Sentences":"Everyone at the wedding danced when the music started."}
{"Complex Sentences":"We went to the beach in Miami although it was hot."}
{"Complex Sentences":"Ryan yelled at his friend because he was angry."}
{"Complex Sentences":"Please sign up at the front desk if you are interested."}
{"Complex Sentences":"We boarded quickly at Grand Central Station when the train arrived."}
{"Complex Sentences":"Megan stayed strong although she was lonely."}
{"Complex Sentences":"He called immediately from his iPhone because it was urgent."}
{"Complex Sentences":"Take a break in the lounge if you feel tired."}
{"Complex Sentences":"We greeted them warmly at the Marriott when the guests arrived."}
{"Complex Sentences":"He paid attention during the lecture by Professor Clark although it was boring."}
{"Complex Sentences":"Zoe missed the meeting at the office because she was late."}
{"Complex Sentences":"Ask for directions at the information desk if you are lost."}
{"Complex Sentences":"We called for help from AAA when the car broke down."}
{"Complex Sentences":"He finished the race at the New York Marathon although he was injured."}
{"Complex Sentences":"She asked for the recipe from Chef Gordon Ramsay because it was delicious."}
{"Complex Sentences":"Please join us at the Rotary Club meeting if you have time."}
{"Complex Sentences":"The mother comforted him at the pediatrician's office when the baby cried."}
{"Complex Sentences":"She managed to focus at the Starbucks cafe although it was loud."}
{"Complex Sentences":"He asked many questions at the science fair because he was curious."}
{"Complex Sentences":"Let's go out for dinner at Olive Garden if you are free."}
{"Complex Sentences":"Everyone was silent at the Regal Cinemas when the movie started."}
{"Complex Sentences":"He succeeded in completing the project for Microsoft although it was challenging."}
{"Complex Sentences":"She made beautiful art at the New York Art Academy because she was creative."}
{"Complex Sentences":"There's food in the kitchen at Grandma's house if you are hungry."}
{"Complex Sentences":"The audience applauded at the Broadway theater when the show ended."}
{"Complex Sentences":"They took the chance in the stock market although it was risky."}
{"Complex Sentences":"They made the change in the company's policy because it was necessary."}
{"Complex Sentences":"Please contact the admissions office at Harvard if you are interested."}
{"Complex Sentences":"We lit a fire at the beach in Malibu when the sun set."}
{"Complex Sentences":"She performed well at the recital although she was nervous."}
{"Complex Sentences":"He prioritized it at work because it was important."}
{"Complex Sentences":"Feel free to ask the concierge at the Ritz-Carlton if you need anything."}
{"Complex Sentences":"It became a bestseller on Amazon when the book was published."}
{"Complex Sentences":"She continued working in her studio although it was noisy."}
{"Complex Sentences":"He got the job at Tesla because he was talented."}
{"Complex Sentences":"Raise your hand at the seminar if you have a question."}
{"Complex Sentences":"We took shelter in the basement when the storm hit."}
{"Complex Sentences":"We decided to visit the Grand Canyon although it was far."}
{"Complex Sentences":"Everyone at the community center liked her because she was kind."}
{"Complex Sentences":"Let us know at the front desk if you want to participate."}
{"Complex Sentences":"Everyone at the university sighed in relief when the test was over."}
{"Complex Sentences":"He endured it during the physical therapy session although it was painful."}
{"Complex Sentences":"They laughed a lot at the comedy club because it was funny."}
{"Complex Sentences":"We can begin the presentation at the conference if you are ready."}
{"Complex Sentences":"The class at Springfield Elementary ended when the bell rang."}
{"Complex Sentences":"They found their way in the forest although it was dark."}
{"Complex Sentences":"They trusted him with the finances at the firm because he was honest."}
{"Complex Sentences":"Keep reading the article in the New York Times if you want to know more."}
{"Complex Sentences":"The streets of New Orleans were filled with people when the parade started."}
{"Complex Sentences":"They kept talking at the after-party although it was late."}
{"Complex Sentences":"They couldn't use the equipment at the gym because it was broken."}
{"Complex Sentences":"Wear a jacket from North Face if you feel cold."}
{"Complex Sentences":"We were surprised by the new arrivals when the door opened."}
{"Complex Sentences":"It was effective in solving the issue although it was simple."}
{"Complex Sentences":"He achieved his goal at the tournament because he was determined."}
{"Complex Sentences":"I can help you with the project if you are busy."}
{"Complex Sentences":"Everyone at the clubhouse was excited when the party began."}
{"Complex Sentences":"They played outside at the park although it was raining."}
{"Complex Sentences":"They bought the tickets for the concert because it was cheap."}
{"Complex Sentences":"You won't get hurt during the activity if you are careful."}
{"Complex Sentences":"We woke up in the hotel room when the alarm went off."}
{"Complex Sentences":"He didn't give up on his dream although it was hard."}
{"Complex Sentences":"She donated money to the Red Cross because she was generous."}
{"Complex Sentences":"Call an Uber if you need a ride."}
{"Complex Sentences":"Everyone at the office was shocked when the news broke."}
{"Complex Sentences":"They enjoyed the concert at Madison Square Garden although it was crowded."}
{"Complex Sentences":"It worked perfectly in the lab because it was new."}
{"Complex Sentences":"Look at the map in the museum if you feel lost."}
{"Complex Sentences":"Everyone at the daycare was happy when the baby smiled."}
{"Complex Sentences":"They finished the project at the construction site although it was tiring."}
{"Complex Sentences":"They kept it safe in the vault because it was valuable."}
{"Complex Sentences":"There's water in the fridge at the break room if you are thirsty."}
{"Complex Sentences":"We cheered at the stadium when the lights came back on."}
{"Complex Sentences":"He slept well in the dormitory although it was noisy."}
{"Complex Sentences":"They handled it carefully in the store because it was fragile."}
{"Complex Sentences":"Let's start the event at the convention center if you are excited."}
{"Complex Sentences":"We celebrated in the locker room when the game ended."}
{"Complex Sentences":"It was worth it to stay at the luxury resort although it was expensive."}
{"Complex Sentences":"He stepped forward at the chess match because it was his turn."}
{"Complex Sentences":"We can leave now for the airport if you are ready."}
{"Complex Sentences":"The day began in the city when the sun rose."}
{"Complex Sentences":"They walked to the village although it was far."}
{"Complex Sentences":"She faced the danger in the haunted house because she was brave."}
{"Complex Sentences":"Report them to the IT department if you have any issues."}
{"Complex Sentences":"We used candles in the cabin when the power went out."}
{"Complex Sentences":"He kept working in his office although it was late."}
{"Complex Sentences":"She wrote it down in her journal because it was important."}
{"Complex Sentences":"Share it with others on social media if you feel happy."}
{"Complex Sentences":"We all got a piece at the birthday party when the cake was cut."}
{"Complex Sentences":"They went swimming in the lake although it was cold."}
{"Complex Sentences":"She called immediately from her office phone because it was urgent."}
{"Complex Sentences":"Let's go to the conference room if you are ready."}
{"Complex Sentences":"We danced at the wedding reception when the song played."}
{"Complex Sentences":"He fixed it in his garage although it was broken."}
{"Complex Sentences":"They stayed inside at the cabin because it was raining."}
{"Complex Sentences":"Get some rest in the guest room if you are tired."}
{"Complex Sentences":"We answered it at the front door when the doorbell rang."}
{"Complex Sentences":"They enjoyed the day at the amusement park although it was hot."}
{"Complex Sentences":"They left the restaurant because it was late."}
{"Complex Sentences":"Sign up here for the workshop if you are interested."}
{"Complex Sentences":"The lights dimmed in the theater when the movie started."}
{"Complex Sentences":"They succeeded in the competition although it was difficult."}
{"Complex Sentences":"Everyone wanted one in the office because it was new."}
{"Complex Sentences":"Don't hesitate to ask the librarian if you need help."}
{"Complex Sentences":"The sky lit up over the river when the fireworks began."}
{"Complex Sentences":"They continued the expedition although it was dangerous."}
{"Complex Sentences":"He pursued it at the university because it was his dream."}
{"Complex Sentences":"Let's meet at the cafe if you are free."}
{"Complex Sentences":"We went outside in the backyard when the rain stopped."}
{"Complex Sentences":"She understood the instructions although it was complicated."}
{"Complex Sentences":"They did it for the team because it was necessary."}
{"Complex Sentences":"Please ask the instructor if you have questions."}
{"Complex Sentences":"We found candles in the cupboard when the lights went out."}
{"Complex Sentences":"He concentrated in the library although it was noisy."}
{"Complex Sentences":"They ate it all at the picnic because it was delicious."}
{"Complex Sentences":"There's food in the fridge at Aunt Mary's house if you are hungry."}
{"Complex Sentences":"Everyone was silent in the auditorium when the show began."}
{"Complex Sentences":"It was beautiful in design although it was simple."}
{"Complex Sentences":"We used flashlights during the hike because it was dark."}
{"Complex Sentences":"Find out more at the information booth if you are curious."}
{"Complex Sentences":"We greeted them at the reception when the guests arrived."}
{"Complex Sentences":"They did it for the team although it was challenging."}
{"Complex Sentences":"They focused on it during the meeting because it was important."}
{"Complex Sentences":"Let the concierge know at the front desk if you need anything."}
{"Complex Sentences":"We got on board at the station when the train arrived."}
{"Complex Sentences":"They traveled to visit the museum although it was far."}
{"Complex Sentences":"They saved it in the family safe because it was valuable."}
{"Complex Sentences":"We can start the presentation if you are ready."}
{"Complex Sentences":"They traveled far although it was late."}
{"Complex Sentences":"They found their way although it was dark."}
{"Complex Sentences":"They saved it because it was valuable."}
{"Complex Sentences":"Look for it if you need help."}
{"Complex Sentences":"You should go because it’s necessary."}
{"Complex Sentences":"We went home although it was far."}
{"Complex Sentences":"You can read more if you’re interested."}
{"Complex Sentences":"They stayed longer although it was dark."}
{"Complex Sentences":"We saved it because it was useful."}
{"Complex Sentences":"Visit the office if you have time."}
{"Complex Sentences":"You can call if you need assistance."}
{"Complex Sentences":"She stayed longer because she was interested."}
{"Complex Sentences":"You should report it if you notice something."}
{"Complex Sentences":"He continued working although it was hard."}
{"Complex Sentences":"You should stay because it’s important."}
{"Complex Sentences":"Ask the receptionist if you have any issues."}
{"Complex Sentences":"They will inform us when the time comes."}
{"Complex Sentences":"You can inquire if you have questions."}
{"Complex Sentences":"She did it although it was difficult."}
{"Complex Sentences":"They will call us when they’re ready."}
{"Complex Sentences":"They should finish soon because it’s urgent."}
{"Complex Sentences":"You should proceed if you’re sure."}
{"Complex Sentences":"They can start now because it’s ready."}
{"Complex Sentences":"Visit the helpdesk if you have questions."}
{"Complex Sentences":"They started late although it was important."}
{"Complex Sentences":"Check the schedule if you’re unsure."}
{"Complex Sentences":"They waited because it was necessary."}
{"Complex Sentences":"You can visit when it’s open."}
{"Complex Sentences":"They stayed up late although they were tired."}
{"Complex Sentences":"He stayed because it was necessary."}
{"Complex Sentences":"Ask for details if you’re unsure."}
{"Complex Sentences":"You can inquire because it’s allowed."}
{"Complex Sentences":"He kept going although it was hard."}
{"Complex Sentences":"They saved it because it was essential."}
{"Complex Sentences":"You should wait if you’re unsure."}
{"Complex Sentences":"They can call when they’re ready."}
{"Complex Sentences":"Check the website if you need information."}
{"Complex Sentences":"You can leave when it’s over."}
{"Complex Sentences":"They waited although it was difficult."}
{"Complex Sentences":"Ask for help if you’re stuck."}
{"Complex Sentences":"They proceeded because it was urgent."}
{"Complex Sentences":"Visit the counter if you have questions."}
{"Complex Sentences":"They started because it was important."}
{"Complex Sentences":"He finished it although it was late."}
{"Complex Sentences":"You can start now because it’s ready."}
{"Complex Sentences":"Ask for assistance if you need it."}
{"Complex Sentences":"She continued although it was hard."}
{"Complex Sentences":"Visit the front desk if you need help."}
{"Complex Sentences":"You should rest because it’s late."}
{"Complex Sentences":"They saved it although it was damaged."}
{"Complex Sentences":"You should report it because it’s urgent."}
{"Complex Sentences":"You can continue if you’re ready."}
{"Complex Sentences":"He kept going although it was challenging."}
{"Complex Sentences":"They called because it was necessary."}
{"Complex Sentences":"You should wait if you’re unsure."}
{"Complex Sentences":"Visit the office when it’s open."}
{"Complex Sentences":"They waited although it was late."}
{"Complex Sentences":"Ask for directions if you’re lost."}
{"Complex Sentences":"You can proceed if you’re ready."}
{"Complex Sentences":"They stayed because it was important."}
{"Complex Sentences":"You can call when it’s time."}
{"Complex Sentences":"Ask for help if you need assistance."}
{"Complex Sentences":"They started although it was difficult."}
{"Complex Sentences":"Check the website for more details."}
{"Complex Sentences":"They waited because it was necessary."}
{"Complex Sentences":"Visit the office when you have time."}
{"Complex Sentences":"They proceeded although it was hard."}
{"Complex Sentences":"Ask for more information if you’re interested."}
{"Complex Sentences":"You can continue if you’re ready."}
{"Complex Sentences":"They stayed because it was essential."}
{"Complex Sentences":"You should leave when it’s over."}
{"Complex Sentences":"Ask for assistance if you need help."}
{"Complex Sentences":"They started because it was urgent."}
{"Complex Sentences":"He finished it although it was challenging."}
{"Complex Sentences":"You should rest when it’s late."}
{"Complex Sentences":"They saved it although it was difficult."}
{"Complex Sentences":"You should report it if it’s urgent."}
{"Complex Sentences":"She bought the car because it was on sale."}
{"Complex Sentences":"He called her when he got home."}
{"Complex Sentences":"They canceled the trip because the weather was bad."}
{"Complex Sentences":"The team won the game because they practiced hard."}
{"Complex Sentences":"She left the office when the meeting ended."}
{"Complex Sentences":"We celebrated because it was their anniversary."}
{"Complex Sentences":"He felt better after he took the medicine."}
{"Complex Sentences":"She applied for the job because it was her dream."}
{"Complex Sentences":"They traveled to Japan when they had a vacation."}
{"Complex Sentences":"The project was completed because the team worked overtime."}
{"Complex Sentences":"He stayed up late because he was studying for an exam."}
{"Complex Sentences":"She went to the store because they were out of milk."}
{"Complex Sentences":"They moved to the city because they found a better job."}
{"Complex Sentences":"The children were excited because it was Christmas."}
{"Complex Sentences":"She cried when she heard the news."}
{"Complex Sentences":"He laughed because the joke was funny."}
{"Complex Sentences":"They built a new house because the old one was too small."}
{"Complex Sentences":"The dog barked because it saw a stranger."}
{"Complex Sentences":"She baked a cake because it was his birthday."}
{"Complex Sentences":"He stayed home because he was feeling sick."}
{"Complex Sentences":"They went to the beach because it was a sunny day."}
{"Complex Sentences":"She painted the room because she wanted a change."}
{"Complex Sentences":"He fixed the car because it was broken."}
{"Complex Sentences":"They went out to dinner because they wanted to celebrate."}
{"Complex Sentences":"She wrote a letter because she missed him."}
{"Complex Sentences":"He planted a tree because he wanted to help the environment."}
{"Complex Sentences":"They adopted a pet because they love animals."}
{"Complex Sentences":"She learned to cook because she wanted to surprise her family."}
{"Complex Sentences":"He played the guitar because he loves music."}
{"Complex Sentences":"They went hiking because they enjoy nature."}
{"Complex Sentences":"She volunteered because she wanted to give back to the community."}
{"Complex Sentences":"He exercised every day because he wanted to stay healthy."}
{"Complex Sentences":"They took a vacation because they needed a break."}
{"Complex Sentences":"She read the book because it was recommended by a friend."}
{"Complex Sentences":"He watched the movie because it was based on a true story."}
{"Complex Sentences":"They attended the concert because they love the band."}
{"Complex Sentences":"She went to bed early because she was tired."}
{"Complex Sentences":"He cleaned the house because it was messy."}
{"Complex Sentences":"They visited the museum because they are interested in history."}
{"Complex Sentences":"She bought a new dress because there was a sale."}
{"Complex Sentences":"He studied hard because he wanted to pass the test."}
{"Complex Sentences":"They moved to a new city because of a job opportunity."}
{"Complex Sentences":"She saved money because she wanted to buy a car."}
{"Complex Sentences":"He learned a new language because he wanted to travel."}
{"Complex Sentences":"They celebrated because it was their wedding anniversary."}
{"Complex Sentences":"She baked cookies because she wanted to share with her neighbors."}
{"Complex Sentences":"He painted a picture because he loves art."}
{"Complex Sentences":"They went camping because they enjoy the outdoors."}
{"Complex Sentences":"She decorated the house because it was the holidays."}
{"Complex Sentences":"He repaired the fence because it was damaged."}
{"Complex Sentences":"They planted a garden because they love fresh vegetables."}
{"Complex Sentences":"She joined a club because she wanted to meet new people."}
{"Complex Sentences":"He wrote a story because he has a vivid imagination."}
{"Complex Sentences":"They attended the workshop because they wanted to learn new skills."}
{"Complex Sentences":"She cooked a big dinner because she had guests over."}
{"Complex Sentences":"He built a birdhouse because he loves nature."}
{"Complex Sentences":"They donated clothes because they wanted to help those in need."}
{"Complex Sentences":"She sewed a dress because she wanted a unique outfit."}
{"Complex Sentences":"He played soccer because it is his favorite sport."}
{"Complex Sentences":"They went for a walk because the weather was nice."}
{"Complex Sentences":"She learned to dance because she loves music."}
{"Complex Sentences":"He fixed the computer because it had a virus."}
{"Complex Sentences":"They went on a road trip because they love adventure."}
{"Complex Sentences":"She painted her nails because she wanted to look nice."}
{"Complex Sentences":"He baked bread because he enjoys cooking."}
{"Complex Sentences":"They built a snowman because it was snowing."}
{"Complex Sentences":"She read a book because she was bored."}
{"Complex Sentences":"He played chess because he enjoys strategy games."}
{"Complex Sentences":"They went skiing because they love the snow."}
{"Complex Sentences":"She wrote in her journal because she likes to document her thoughts."}
{"Complex Sentences":"He played basketball because he enjoys sports."}
{"Complex Sentences":"They went to the fair because they wanted to have fun."}
{"Complex Sentences":"She learned to knit because she enjoys crafting."}
{"Complex Sentences":"He repaired the bike because it had a flat tire."}
{"Complex Sentences":"They went fishing because they enjoy the quiet."}
{"Complex Sentences":"She baked a pie because she loves to bake."}
{"Complex Sentences":"He played video games because he finds them entertaining."}
{"Complex Sentences":"They went to a play because they love theater."}
{"Complex Sentences":"She wrote a poem because she loves to write."}
{"Complex Sentences":"He drew a picture because he loves to draw."}
{"Complex Sentences":"They went to the zoo because they love animals."}
{"Complex Sentences":"She cooked dinner because she enjoys cooking."}
{"Complex Sentences":"He built a model because he loves building things."}
{"Complex Sentences":"They went to the park because it was a nice day."}
{"Complex Sentences":"She played the piano because she loves music."}
{"Complex Sentences":"He read a magazine because he was interested in the topic."}
{"Complex Sentences":"They went to a festival because they love the festivities."}
{"Complex Sentences":"She joined a gym because she wanted to get fit."}
{"Complex Sentences":"He took a nap because he was tired."}
{"Complex Sentences":"They went to a restaurant because they wanted a nice meal."}
{"Complex Sentences":"She did yoga because she wanted to relax."}
{"Complex Sentences":"He watched a documentary because he wanted to learn."}
{"Complex Sentences":"They went to a spa because they wanted to unwind."}
{"Complex Sentences":"She painted a mural because she loves art."}
{"Complex Sentences":"He made a sculpture because he enjoys creating."}
{"Complex Sentences":"They went to a comedy show because they love to laugh."}
{"Complex Sentences":"She read a newspaper because she wanted to stay informed."}
{"Complex Sentences":"He attended a lecture because he wanted to learn more."}
{"Complex Sentences":"They went to a market because they love fresh produce."}
{"Complex Sentences":"She sang a song because she loves to sing."}
{"Complex Sentences":"He played the drums because he enjoys music."}
{"Complex Sentences":"They went to a gallery because they love art."}
{"Complex Sentences":"She practiced the violin because she wanted to improve."}
{"Complex Sentences":"He wrote a letter because he wanted to communicate."}
{"Complex Sentences":"They went to a beach because they love the ocean."}
{"Complex Sentences":"She baked a cake because she enjoys baking."}
{"Complex Sentences":"He built a shelf because he needed more storage."}
{"Complex Sentences":"They went to a dance class because they love to dance."}
{"Complex Sentences":"She made jewelry because she enjoys crafting."}
{"Complex Sentences":"He played tennis because he loves sports."}
{"Complex Sentences":"They went to a botanical garden because they love plants."}
{"Complex Sentences":"She wrote a blog because she enjoys writing."}
{"Complex Sentences":"He fixed the lamp because it was broken."}
{"Complex Sentences":"They went to a book club because they love reading."}
{"Complex Sentences":"She cooked breakfast because she enjoys cooking."}
{"Complex Sentences":"He repaired the roof because it was leaking."}
{"Complex Sentences":"They went to an aquarium because they love marine life."}
{"Complex Sentences":"She sewed a quilt because she enjoys sewing."}
{"Complex Sentences":"He learned to play the guitar because he loves music."}
{"Complex Sentences":"They went to a farm because they love animals."}
{"Complex Sentences":"She baked muffins because she loves to bake."}
{"Complex Sentences":"He played golf because he enjoys sports."}
{"Complex Sentences":"They went to a planetarium because they love astronomy."}
{"Complex Sentences":"She wrote a short story because she loves to write."}
{"Complex Sentences":"He built a treehouse because he enjoys construction."}
{"Complex Sentences":"They went to a winery because they love wine."}
{"Complex Sentences":"She painted pottery because she enjoys art."}
{"Complex Sentences":"He fixed the faucet because it was leaking."}
{"Complex Sentences":"They went to a library because they love books."}
{"Complex Sentences":"She cooked soup because she enjoys cooking."}
{"Complex Sentences":"He repaired the door because it was squeaky."}
{"Complex Sentences":"They went to a museum because they love history."}
{"Complex Sentences":"She crocheted a scarf because she enjoys knitting."}
{"Complex Sentences":"He learned to swim because he loves the water."}
{"Complex Sentences":"They went to a vineyard because they love wine."}
{"Complex Sentences":"She baked bread because she loves to bake."}
{"Complex Sentences":"He played baseball because he enjoys sports."}
{"Complex Sentences":"They went to a nature reserve because they love wildlife."}
{"Complex Sentences":"She wrote a novel because she loves to write."}
{"Complex Sentences":"He built a boat because he enjoys sailing."}
{"Complex Sentences":"They went to a brewery because they love beer."}
{"Complex Sentences":"She painted landscapes because she enjoys painting."}
{"Complex Sentences":"He fixed the chair because it was wobbly."}
{"Complex Sentences":"They went to a flea market because they love bargains."}
{"Complex Sentences":"She cooked pasta because she enjoys cooking."}
{"Complex Sentences":"He repaired the watch because it was broken."}
{"Complex Sentences":"They went to an opera because they love music."}
{"Complex Sentences":"She knitted a sweater because she enjoys knitting."}
{"Complex Sentences":"He learned to snowboard because he loves the snow."}
{"Complex Sentences":"They went to a wildlife sanctuary because they love animals."}
{"Complex Sentences":"She baked a pie because she loves to bake."}
{"Complex Sentences":"He played hockey because he enjoys sports."}
{"Complex Sentences":"They went to a sculpture park because they love art."}
{"Complex Sentences":"She wrote a screenplay because she loves to write."}
{"Complex Sentences":"He built a cabin because he enjoys carpentry."}
{"Complex Sentences":"They went to a cider mill because they love cider."}
{"Complex Sentences":"She painted portraits because she enjoys painting."}
{"Complex Sentences":"He fixed the table because it was broken."}
{"Complex Sentences":"They went to a thrift store because they love vintage items."}
{"Complex Sentences":"She cooked curry because she enjoys cooking."}
{"Complex Sentences":"He repaired the clock because it wasn't working."}
{"Complex Sentences":"They went to a jazz club because they love music."}
{"Complex Sentences":"She crocheted a blanket because she enjoys knitting."}
{"Complex Sentences":"He learned to surf because he loves the ocean."}
{"Complex Sentences":"They went to a nature preserve because they love nature."}
{"Complex Sentences":"She baked cookies because she loves to bake."}
{"Complex Sentences":"He played rugby because he enjoys sports."}
{"Complex Sentences":"They went to a sculpture exhibit because they love art."}
{"Complex Sentences":"She wrote a song because she loves to write."}
{"Complex Sentences":"He built a deck because he enjoys construction."}
{"Complex Sentences":"They went to a farmers' market because they love fresh produce."}
{"Complex Sentences":"She painted abstracts because she enjoys painting."}
{"Complex Sentences":"He fixed the swing because it was broken."}
{"Complex Sentences":"They went to a craft fair because they love handmade items."}
{"Complex Sentences":"She cooked a feast because she enjoys cooking."}
{"Complex Sentences":"He repaired the guitar because it had a broken string."}
{"Complex Sentences":"They went to a blues festival because they love music."}
{"Complex Sentences":"She knitted a hat because she enjoys knitting."}
{"Complex Sentences":"He learned to kayak because he loves the water."}
{"Complex Sentences":"They went to a wildlife refuge because they love animals."}
{"Complex Sentences":"She baked brownies because she loves to bake."}
{"Complex Sentences":"He played volleyball because he enjoys sports."}
{"Complex Sentences":"They went to an art exhibit because they love art."}
{"Complex Sentences":"She wrote a memoir because she loves to write."}
{"Complex Sentences":"He built a pergola because he enjoys woodworking."}
{"Complex Sentences":"They went to a food festival because they love to try new foods."}
{"Complex Sentences":"She painted still lifes because she enjoys painting."}
{"Complex Sentences":"He fixed the blender because it wasn't working."}
{"Complex Sentences":"They went to a garage sale because they love finding deals."}
{"Complex Sentences":"She cooked a stir-fry because she enjoys cooking."}
{"Complex Sentences":"He repaired the bicycle because it had a flat tire."}
{"Complex Sentences":"They went to a rock concert because they love music."}
{"Complex Sentences":"She crocheted mittens because she enjoys knitting."}
{"Complex Sentences":"He learned to snorkel because he loves the ocean."}
{"Complex Sentences":"They went to a botanical conservatory because they love plants."}
{"Complex Sentences":"She baked cupcakes because she loves to bake."}
{"Complex Sentences":"He played lacrosse because he enjoys sports."}
{"Complex Sentences":"They went to a ceramics class because they love art."}
{"Complex Sentences":"She wrote a fantasy novel because she loves to write."}
{"Complex Sentences":"He built a bookshelf because he enjoys woodworking."}
{"Complex Sentences":"They went to a food truck rally because they love street food."}
{"Complex Sentences":"She painted a mural because she enjoys large projects."}
{"Complex Sentences":"He fixed the doorbell because it wasn't working."}
{"Complex Sentences":"They went to an antique shop because they love vintage items."}
{"Complex Sentences":"She cooked jambalaya because she enjoys cooking."}
{"Complex Sentences":"He repaired the roof because it was leaking."}
{"Complex Sentences":"They went to a folk music festival because they love traditional music."}
{"Complex Sentences":"She knitted a shawl because she enjoys knitting."}
{"Complex Sentences":"He learned to scuba dive because he loves the ocean."}
{"Complex Sentences":"They went to a nature center because they love wildlife."}
{"Complex Sentences":"She baked scones because she loves to bake."}
{"Complex Sentences":"He played badminton because he enjoys sports."}
{"Complex Sentences":"They went to an art studio because they love creating."}
{"Complex Sentences":"She wrote a thriller because she loves to write."}
{"Complex Sentences":"He built a gazebo because he enjoys construction."}
{"Complex Sentences":"They went to a chocolate festival because they love sweets."}
{"Complex Sentences":"She painted watercolors because she enjoys the medium."}
{"Complex Sentences":"He fixed the stereo because it wasn't working."}
{"Complex Sentences":"They went to a swap meet because they love trading items."}
{"Complex Sentences":"She cooked paella because she enjoys trying new recipes."}
{"Complex Sentences":"He repaired the driveway because it had cracks."}
{"Complex Sentences":"They went to a gospel concert because they love spiritual music."}
{"Complex Sentences":"She crocheted a pillow because she enjoys knitting."}
{"Complex Sentences":"He learned to windsurf because he loves the ocean."}
{"Complex Sentences":"They went to a bird sanctuary because they love birds."}
{"Complex Sentences":"She baked quiche because she loves to bake."}
{"Complex Sentences":"He played cricket because he enjoys sports."}
{"Complex Sentences":"They went to a painting workshop because they love art."}
{"Complex Sentences":"She wrote a romance novel because she loves to write."}
{"Complex Sentences":"He built a dock because he enjoys working on projects."}
{"Complex Sentences":"They went to a culinary school because they love to cook."}
{"Complex Sentences":"She painted with oils because she enjoys the technique."}
{"Complex Sentences":"He fixed the microwave because it wasn't working."}
{"Complex Sentences":"They went to a flea market because they love bargains."}
{"Complex Sentences":"She cooked lasagna because she enjoys making Italian dishes."}
{"Complex Sentences":"He repaired the sink because it was leaking."}
{"Complex Sentences":"They went to a baroque music concert because they love classical music."}
{"Complex Sentences":"She knitted socks because she enjoys knitting."}
{"Complex Sentences":"He learned to paddleboard because he loves the water."}
{"Complex Sentences":"They went to a wildlife park because they love nature."}
{"Complex Sentences":"She baked bread because she loves the smell."}
{"Complex Sentences":"He played rugby because he enjoys the game."}
{"Complex Sentences":"They went to an art exhibit because they love modern art."}
{"Complex Sentences":"She wrote a mystery because she loves suspense."}
{"Complex Sentences":"He built a greenhouse because he enjoys gardening."}
{"Complex Sentences":"They went to a barbecue competition because they love grilling."}
{"Complex Sentences":"She painted with acrylics because she enjoys the vibrancy."}
{"Complex Sentences":"He fixed the lawnmower because it wasn't working."}
{"Complex Sentences":"They went to a secondhand shop because they love finding unique items."}
{"Complex Sentences":"She cooked sushi because she enjoys Japanese cuisine."}
